package nctu.cs.cgv.itour.object;

import java.util.HashMap;
import java.util.Map;

public class SpotDescriptionMap {
    public Map<String, String> descriptionMap;

    public SpotDescriptionMap() {
        descriptionMap = new HashMap<>();
        descriptionMap.put("3D意象彩繪階梯", "淡水福佑宮的3D意象彩繪階梯畫有淡水夕陽和一些與淡水有關的彩繪，諸如：淡水的落日、舢舨船、紅毛城、長老教會等等");
        descriptionMap.put("三協成博物館", "三協成糕餅鋪於1935年成立，三協成的意義就是希望三兄弟可以同心協力經營。早期最初從喜餅製作開始，後台向英國領事館主廚學習英國水果派的製作，造就了三協成的糕餅融合了傳統與西方的風味。");
        descriptionMap.put("小白宮", "1860年代淡水開港通商，這裡成為洋人在淡水經商、貿易、居住的主要地區，在地人習慣由房屋外觀的顏色為西式建築命名，由於前清淡水關稅務司官邸室內外皆漆成白色，因而被在地人暱稱為「小白宮」。");
        descriptionMap.put("之間茶食器", "位於老街尾的之間茶食器，以在地故事為基底，打造全新的茶飲文化，在這個滿是咖啡的世道裡，有一處正飄散著雋永的茶香，等待著你，發生關係。");
        descriptionMap.put("文化阿給", "「阿給あげ」是有名的淡水小吃，全台灣大概也只有這裡才能找到高密度的阿給店家，真理阿給一條街「文化」「老牌」「三姊妹」，而文化特別在營業時間較晚");
        descriptionMap.put("木下靜涯紀念公園", "木下靜涯在淡水的住處，位於三層厝26番地，是一古舊的磚造瓦蓋兩層樓房，可以眺望淡水河和觀音山，視野極佳，木下於畫中用印稱「世外莊」，可見淡水在木下心目中的地位。");
        descriptionMap.put("可口魚丸", "魚丸跟肉包是一樣的內餡，所以吃魚丸會有吃到肉包的感覺，店內客人們幾乎都是點一碗湯+肉包，搭配起來一個50元銅板有找！");
        descriptionMap.put("白樓故事牆", "由馬偕博士學生嚴清華所建，曾是淡水著名豪宅洋行，也一度是畫家們最愛的淡水建築物之一；然而，幾經輾轉易手，於1992年拆除改建公寓後，人們只能從畫作中憑弔白樓身影。");
        descriptionMap.put("合益魚酥", "40年不變的純手工淡水老街魚酥，新鮮原料無添加防腐劑，高鈣低油量是您最佳的選擇。");
        descriptionMap.put("多田榮吉故居", "日治時期擔任淡水街長的多田榮吉私人宅邸，建於1937年，據稱多田榮吉還申請了自用自來水，成為全淡水、全臺第一戶接自來水的民宅。");
        descriptionMap.put("百葉溫州大餛飩", "百葉溫州餛飩是淡水著名小吃店，有幾十年的歷史，而老闆是道地的溫州人，溫州特產之一便是餛飩，老闆將最熟悉的家鄉味讓其他人也能夠與他分享這家鄉美味。");
        descriptionMap.put("老牌阿給", "老牌阿給一早5點就營業，有不少當地人可是把這的阿給當早餐來吃。而店家只要當天所準備的食材賣完就休息，所以往往在假日的時候，通常會讓下午2點後才前來的顧客，只能望著已關下的鐵門嘆氣。");
        descriptionMap.put("姑娘樓", "姑娘樓是吳威廉為淡水女宣教士建的宿舍，由於最先住的是高姑娘、金姑娘，淡水人泛稱「姑娘樓」。姑娘（Miss）是指奉獻青春才華和終身幸福來台的女宣教士，目前作為真理大學的校長室。");
        descriptionMap.put("牧師樓", "為了提供當時來臺的女宣教士一個合適住所，吳威廉牧師在西班牙式的馬偕故居西側擇地建屋，並親自設計督工，聘請當時著名的洋樓匠師黃阿樹施工；建材採用當時廈門的磚材和福杉，淡水人稱它為「姑娘樓」，目前為真理大學的校長室。西元1909年，吳威廉牧師又在「姑娘樓」西側，建了一棟相似的紅磚洋樓作為其寓所。後來明有德、孫雅各兩位牧師(淡中代校長)居住過，因而俗稱「牧師樓」，目前為真理大學教職員辦公室。");
        descriptionMap.put("金色水岸", "「金色水岸」是位於淡水老街後方1.5公里的河岸景觀，包括林蔭步道、親水河岸、漁作空間、水上舞台、咖啡座椅及觀潮灣等。沿著淡水河畔散步，可以看見岸邊商店街道整理得煥然一新，各式有趣的商店林立。坐在河畔的歐式咖啡店喝杯咖啡，遠眺對岸的觀音山、出海口，寬廣的視野令人心曠神怡。");
        descriptionMap.put("金色水岸自行車道", "因為淡水河面映著夕陽所反射出的金色柔柔波光，因此這條自行車道被取名為「金色水岸自行車道」，沿線美麗的風景與知名的觀光景點，使其美名不脛而走。");
        descriptionMap.put("長堤咖啡餐館", "淡水長堤夕陽落日。咖啡餐館，提供鬆餅、咖啡、冰沙、奶茶等飲料，義大利麵、燉飯、漢堡等主食。2樓有露天陽台可以欣賞觀音山，淡水河岸和浪漫的夕陽落日。");
        descriptionMap.put("阿婆鐵蛋", "阿婆鐵蛋在淡水至今已有超過四十年的歷史，原創始人楊碧雲女士最早是經營自助餐與麵店，因為滷蛋滯銷覺得浪費，便將滷蛋不斷地持續滷製以延長食用時間，結果反覆滷製硬梆梆的滷蛋反而讓許多客人吃了都讚不絕口。");
        descriptionMap.put("阿媽的酸梅湯", "老闆承繼母親煮酸梅湯的古法，以梅子加上洛神花、菊花、參鬚、百子、薄荷等中藥，一起熬煮成濃郁甘甜的酸梅湯，尤其炎炎夏日、口渴難耐，喝在嘴裡倍覺清涼爽快，比一般過甜的飲料或汽水還來得解暑，難怪一推出很快便成為遊客人手一杯的飲品。");
        descriptionMap.put("信不信由你搜奇博物館", "您將會進入一個充滿訝異和驚奇的另類世界，各館展出內容包括：寰宇搜奇、科幻外星人、珍奇動物、水族生物、西安兵馬俑、不可思議劃廊、趣味活動等上百件商品，每一樣展品都有一段精彩故事和傳聞。");
        descriptionMap.put("紅毛城", "紅毛城，古稱安東尼堡，是一座位於台灣新北市淡水區的古蹟。最早建城是在1628年統治台灣北部的西班牙人所興建的「聖多明哥城」，但後來聖多明哥城遭到摧毀，1644年荷蘭人於聖多明哥城原址附近予以重建，並命名為「安東尼堡」。而由於當時漢人稱呼荷蘭人為紅毛，因此這個城就被他們稱作紅毛城。");
        descriptionMap.put("紅樓中餐廳", "綜合各地中式料理，特別推薦創新的中式料理。每季本店主廚設計當季筵席及應時新菜色，提供來賓更多選擇，在如此宜古宜今、宜中宜西的氣氛下享用美食，是令人印象深刻的獨特的經驗。");
        descriptionMap.put("英國領事館", "前清英國領事官邸，是一棟紅磚二層洋樓，是英國在臺灣所建造的第三座（也是最後一座）領事官邸。牆壁用的是中國的紅磚，屋頂是閩南式紅瓦，整體建築呈現多樣化的異國風情。洋樓內有紅磚、拱圈、迴廊和斜屋頂，是典型英國「殖民地樣式建築」。內部有客廳、書房、餐廳、旋轉式樓梯、壁爐等空間與設施，部分空間模擬自當時的家居情境。");
        descriptionMap.put("英專夜市", "淡水捷運站正對面，一條熱鬧的街，商圈包含了英專路、清水街、博愛街；早期，淡江大學的前身是淡江英語專科學校，稱為淡專或英專，因此通往英專的路就被稱為「英專路」。其中有名的商家有，阿財潤餅、沙茶羊肉、營養沙拉船&甜甜圈、鮑家餡餅、賴記雞蛋糕、滬尾豆花...等。");
        descriptionMap.put("重建街戀愛巷", "這條連接重建街到清水街的小巷子，據傳是過去王昶雄透過畫家陳敬輝而認識並喜歡上其入室弟子—林玉珠，因為兩人在談戀愛時，王昶雄常常會送林玉珠回清水街，充滿戀愛的路程中，總會經過重建街14號旁的這條小巷，故名為戀愛巷。");
        descriptionMap.put("桂橡花園", "大約數十年前，桂樹與橡樹在這河畔人家的後院落地生根，經過了數十個寒暑，桂樹年邁已衰，已禁不起風吹雨打，遷至咖啡屋後的小空地栽種，粗壯的橡樹仍佇立在大門口，勇敢的保護起這座彷彿花園的咖啡屋，她便由此誕生了！");
        descriptionMap.put("海風餐廳", "創業老闆張義雄與妻子盧玉蘭白手起家，憑著新鮮食材與獨門口味，漸漸從小吃攤經營到4層樓的餐廳，成為膾炙人口的知名店家。每日更從北海岸、東北角漁港採購萬里蟹、文蛤、海瓜子等生猛海產，現點現宰現料理，成為老街最生動的廚藝風景。");
        descriptionMap.put("海關碼頭", "淡水海關碼頭位在淡水區中正路259號、紅毛城對面，連接淡水老街河岸的最底端，全長150公尺、占地2771坪，碼頭上現在還可見到當年船隻停泊的繫船柱。於2000年6月27日公告為市定古蹟、類別為碼頭，面積9,248平方公尺，由新北市政府文化局管理。");
        descriptionMap.put("真理大學", "真理大學（Aletheia University），是一所台灣基督長老教會在新北市淡水區創辦的私立大學，前身為淡水工商管理專科學校。校名來自希臘語αλήθεια之意。國外亦有哈佛和耶魯以拉丁文vēritās為校訓。是台灣教育史上第一所學院暨大學。");
        descriptionMap.put("真理大學禮拜堂", "建於1997年，共設10層（包括地下及屋頂部份）。當中，大禮拜堂可容納最多約1500人，小禮拜堂則可容納最多約180人，而階梯教室可容納最多約160人。大禮拜堂也設有由荷蘭管風琴廠佩爾斯（PELS&VANLEEUWEN）以手工製造的巨型管風琴，是台灣最高兼為首台設有32呎音管的管風琴。");
        descriptionMap.put("馬偕上岸處", "1872年3月9日下午3時，加拿大宣教士馬偕博士(Rev,Georgelie Mackay)搭「海龍號」由此登陸。自此以淡水為其宣教、醫療和教育之基地，並擇淡水為家，在此娶妻生子，死後埋骨於斯土。");
        descriptionMap.put("馬偕故居(馬偕紀念館)", "馬偕博士在1875年所建，他於此結婚生子，也在此臨終。為西斑牙式的白堊孤廊建築，不僅適合熱帶氣候，其優美的造型配合青翠的埔頂，展望淡水河與觀音山。");
        descriptionMap.put("馬偕租屋處", "馬偕博士初到淡水時的住所，位於馬偕銅像三角公園旁的馬偕街內。租屋處當年的舊模樣已不復存在，而隔鄰的馬偕街20號建物為文史工作者蘇文魁老師所有，蘇老師便在門口小徑前的木門上，設立了有關馬偕家族小歷史及馬偕租屋處不同時空風景轉換的看版。");
        descriptionMap.put("馬偕銅像", "位在馬偕街與淡水老街區三民街交匯處所設立之銅像。為馬偕之路的起點，而馬偕之路的終點則為真理大學內的「大禮拜堂」，整段路線跟馬偕博士有很大的關聯性，包括他的住居、醫館、教會，整段路文化氣息頗豐。");
        descriptionMap.put("得忌利士洋行", "1871年由英國得忌利士洋行所建，2013年完成修復後重新啟用，位於淡水老街末段、埔頂下方，舊稱烽火段。清末，此路段洋行林立，得忌利士洋行便是其中之一。特殊的是，此洋行除了具備一般洋行的貿易功能之外，更主要經營航運業務，是清末臺灣開港及北臺灣航運發展的歷史見證。");
        descriptionMap.put("教士會館", "前身為宣教士宿舍，建於1875年，與馬偕故居同時建造，由馬偕博士親自設計監造，以作為宣教士住宿之用，因外型白色又稱「馬偕的小白宮」。原與馬偕故居為同型建築，二次大戰後租給德記洋行時加蓋了二樓，並在後院蓋了一座翹脊古厝。");
        descriptionMap.put("淡水文化園區-殼牌倉庫", "即嘉士洋行倉庫。1894年著名茶葉外銷洋行向滬尾居民承租約一甲的土地，興建倉庫，經營茶葉貿易。殼牌運輸貿易公司將其買下後作為輕質汽油倉庫。如今為淡水殼牌故事館，整理歷年來所搜集的文字、影像資料及相關文物，在館內常設展出19世紀以來殼牌集團與殼牌倉庫的歷史發展沿革。");
        descriptionMap.put("淡水老街", "一般泛指淡水中正路一帶（從渡船碼頭附近到與中山路交會口路段），含其周圍鄰接之三民街、重建街、中正路與清水街等。位於山坡上的重建街發展最早，兩旁仍有許多木造與磚造的老房舍，走到街底還能從高處遠眺淡水河口。觀光客可在途中店家品嚐特色小吃，並欣賞骨董藝品。");
        descriptionMap.put("淡水捷運站", "台北捷運淡水-象山線的終點之一。站後建有寬廣的親水公園，提供民眾休閒、溜冰等，還有自行車道，並且鄰近淡水老街、古蹟廟宇等。");
        descriptionMap.put("淡水渡船頭", "位處淡水河河口右岸。因應內河藍色公路開航，淡水客船碼頭於民國93年7月完工，浮動式碼頭設計便利觀光小船停靠，對淡水水運事業極具觀光效益。此處搭船可前往漁人碼頭、八里渡船頭、八里左岸或關渡碼頭的搭船處。");
        descriptionMap.put("淡水榕樹道", "依傍著寬廣的淡水河畔。小小的道路綠樹成蔭，可以遠眺觀音山、淡水河並欣賞落日景緻，沿途有多家特色餐廳。");
        descriptionMap.put("淡水禮拜堂", "淡水禮拜堂目前的建物改建於1932年，由偕叡廉設計，為仿歌德式建築的紅磚建築，今日依然由台灣基督長老教會淡水教會使用中，是淡水地區最大的台灣基督長老教會聚會所，約可容納三百人。此教堂曾在1986年修建，將屋頂由陶製屋瓦改為鋁制浪板。");
        descriptionMap.put("清水巖", "又稱淡水祖師廟，建於日治昭和十二年（1937年）。主祀閩南安溪高僧清水祖師，為一座受道教與臺灣民間信仰影響極多的佛教祖師廟，是淡水地方上的信仰中心。每年農曆五月初五、初六舉辦「清水祖師得道紀念日繞境慶典」，俗稱「淡水大拜拜」，是淡水的盛事。");
        descriptionMap.put("理學堂大書院", "理學堂大書院（Oxford College）又稱牛津學堂，由馬偕博士創立於1882年（清光緒八年），因英文名為Oxford College，後世便以「牛津學堂」稱之，為台灣神學院、真理大學的前身，亦曾作為淡江中學的臨時校舍。現為真理大學校史館。");
        descriptionMap.put("許義魚酥", "味香魚丸店是淡水魚酥的創始老店，所賣的魚酥包裝則以老闆許義為名。據說以前魚酥的口感並不是那麼酥脆的，而是老闆許義有一次在炸好後，不小心又掉到油鍋中，大受顧客青睞，過去被當地居民拿來配稀飯吃，現在則成為遊客的休閒零嘴。");
        descriptionMap.put("源味本舖現烤蛋糕", "源味本鋪老闆翁豪良先生秉持著十年練一劍的信念專注於古早味現烤手工蛋糕的完美製程做出讓這世代的年輕人可傳承下去的古早味蛋糕。不間斷的努力研發各種符合顧客的口味與專注食材的選用，遊客的口碑相傳吸引國內外媒體熱烈報導。");
        descriptionMap.put("滬尾偕醫館", "「滬尾偕醫館」不僅是新北市市定古蹟之一，也是台灣「北部」第一家西式醫院。屬閩南式民宅，為馬偕親自設計，並延請淡水在地匠師建造。此處也展出當時醫院的器具用品，以及博士生平簡介、衣物、日用品、教會相關用品等。");
        descriptionMap.put("漁業生活文化影像館", "位於淡水河堤旁的淡水漁業生活文化影像館於2007年開幕，館內陳列許多黑白色系的淡水風景明信片，是館長長期拍攝作品，三代世居淡水的他，將對淡水的濃厚情感寄寓於一張張黑白照片中。此處原為老油庫機房，係由館長向淡水漁會租借。");
        descriptionMap.put("蒸汽火車BK20", "淡水區公欲將淡水區的象徵符號找回來，於2014年以復刻版的BK20蒸汽火車頭為新地標，營造「火車吃水」意象。1958年前的蒸氣火車因為沒有附加煤水車，所以到達淡水站時必須補水，燒水以蒸汽轉為動力，在地民眾就稱這動作為「火車吃水」。");
        descriptionMap.put("福佑宮", "座落於淡水中正路老街上的福佑宮，實際的建造歷史已不可考，屬於第三級古蹟，也是淡水四大廟宇中年代久遠的一座。廟中主要供奉媽祖，又稱媽祖宮，因為沒受到皇帝的封賜，依然保留原宮名而不稱天后宮，是昔日淡水街發展的中心。");
        descriptionMap.put("鄞山寺", "本寺建於道光三年（1823年），形勢良好，背山面水。是臺灣早期少數閩西汀州在臺八縣移民所建，供奉其原鄉守護神定光古佛，並在寺廟兩廂設有接待同鄉後進抵台住宿用的「汀州會館」，此會館保存迄今已成了臺灣碩果僅存的歷史證物。");
        descriptionMap.put("龍山寺", "淡水龍山寺，主祀觀世音菩薩。目前為國家三級古蹟。1982年整修，由彩繪名師洪寶真之嫡傳弟子莊武男負責工程，板橋埔墘黃龜理負責木雕，三重楊瑞西負責剪黏，莊武男負責彩繪與佛像脫胎。1983年初大體完工，再增建中庭拜殿，古物太半保存。");
        descriptionMap.put("藝術工坊", "淡水藝術工坊（Tamsui Art Gallery,TAG）於2011年啟用，不僅是新北市首座公共綠建築，更被評選為臺灣「鑽石級」綠建築。其基地原址於日治時期是一座四連棟形式的日式警眷宿舍，建物本身保留了原址拆除的瓦片，運用於新建築物室內裝修上，保留歷史的記憶。");
        descriptionMap.put("藝術穿堂", "為一幢磚木造二層樓建築，房屋部分為淡水區公所所有。由於房屋年久失修，將房屋拆除後，闢建為一開放空間。藝術穿堂開闢後，遊客可由中正路直接通往馬偕教堂，偕醫館等名勝古蹟，也可以讓遊客更親近淡水地區曲折巷弄的不同面貌。");
    }

    public String getDescription(String key) {
        return descriptionMap.get(key);
    }

    public boolean isSpot(String key) {
        return descriptionMap.containsKey(key);
    }
}

